<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest FireFox disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.appstate.pkg.firefox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FireFox</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.appstate.download.firefox</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>DirectoryCreator</string>
          <key>Arguments</key>
          <dict>
              <key>name</key>
              <string>distribution</string>
              <key>path</key>
              <string>%destination_path%/Contents/Resources/</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>FileCreator</string>
          <key>Arguments</key>
          <dict>
              <key>file_content</key>
              <string>
              {
                "policies": {
                  "DNSOverHTTPS": {
                    "Enabled": false,
                    "Locked" : true
                  }
                }
              }
              </string>
              <key>file_path</key>
              <string>%destination_path%/Contents/Resources/distribution/policies.json</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>ASU-AutoPKG-%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
